app/controllers/searches_controller.rb

SELECT  "searches".* FROM "searches"  ORDER BY "searches"."id" DESC LIMIT 1
UPDATE "searches" SET "saved" = ?, "updated_at" = ? WHERE "searches"."id" = ?  [["saved", "t"], ["updated_at", "2018-11-17 18:39:26.317577"], ["id", 1]]
---
  def save_topic
    if !@current_user.nil?
      to_save = Searches.update_table.last

INSERT INTO "searches" ("user_id", "search_term", "twitter_handle", "from_date", "to_date", "number_of_tweets", "country", "graph_data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "current_search" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["current_search", "1"], ["updated_at", "2018-11-17 18:39:22.918708"], ["id", 2]]
---
  def create
    # Not Finished - Need to implement month end cases

    puts searches_params[:search_term].to_s.blank?
    if searches_params[:search_term].to_s.blank?
      flash[:notice] = "please enter search term"
      redirect_to searches_path
    else
      if @current_user != nil
        now = Date.today
        from_date = now - params[:time].to_i
        @date_hash = Searches.gather_tweets(searches_params[:search_term].to_s, from_date.to_s, now.to_s)
        search_hash = {}
        search_hash[:user_id] = @current_user.id
        search_hash[:search_term] = searches_params[:search_term].to_s
        search_hash[:from_date] = from_date
        search_hash[:to_date] = now
        search_hash[:number_of_tweets] = 0
        search_hash[:country] = @current_user.country
       # search_hash[:saved] = false

        new_search = Searches.create_search!(search_hash)

        search_hash[:graph_data] = @date_hash.to_json

        @current_user.current_search=new_search.id #Set users current search to the search they just made
        @current_user.save

SELECT  "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT 1  [["id", 1]]
---
  def display
    @search_info = params[:search_hash]
    @graph_data = @search_info[:graph_data]
    if !@current_user.current_search.nil?
    @curr_view_search = Searches.find_by_id(@current_user.current_search)