app/controllers/sessions_controller.rb

INSERT INTO "users" ("provider", "session_token", "user_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def createauth
    user = User.find_or_create_from_auth_hash(env["omniauth.auth"])