app/controllers/users_controller.rb

  def show
    redir = true

    if @current_user.nil?
      flash[:notice] = "Must be logged in to view a profile page!"
      redirect_to root_path and return
    end

    #Logic for users friends page

    if (params[:id].to_s != @current_user.id.to_s)

      user_friends = User.get_user_friends_and_ids(@current_user.user_name)
      user_friends_ids = user_friends[1]

      user_friends_ids_to_string = user_friends_ids.map(&:to_s)
      if user_friends_ids_to_string.include?(params[:id].to_s)

        friend_info = User.find_by(id: params[:id])
        @user_friend_name = friend_info.user_name
        @user_saved_topics = friend_info.search

        @search_hashes = []
        if !@user_saved_topics.empty?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT 1  [["user_name", "testuser"]]
SELECT "searches".* FROM "searches" INNER JOIN "searches_users" ON "searches"."id" = "searches_users"."search_id" WHERE "searches_users"."user_id" = ?  [["user_id", 6]]
SELECT COUNT(*) FROM "searches" INNER JOIN "searches_users" ON "searches_users"."searches_id" = "searches"."id" INNER JOIN "users" ON "users"."id" = "searches_users"."user_id" WHERE "searches"."user_id" = ?  [["user_id", 6]]

  def verify_add_friend

    if User.exists?(user_name: params[:user_name])

      if @current_user.friends_list.include?(params[:user_name])
        flash[:notice] = "You already have that person as a friend."
        redirect_to :controller => 'users', :action => 'add_friend'
      else
      @current_user.friends_list.push(params[:user_name])
---
SELECT  1 AS one FROM "users" WHERE "users"."user_name" = ? LIMIT 1  [["user_name", ""]]
UPDATE "users" SET "friends_list" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["friends_list", "---\n- - test\n"], ["updated_at", "2018-11-21 01:18:30.192208"], ["id", 2]]

  def create
    password = user_params[:password]
    verify_password = params[:verify_password][0]     #params[:verify_password] returns an array so take the first index of array
    user_params[:country] = params[:country] #set users country.
    input_params = user_params
    input_params[:country] = params[:country]

    if password == verify_password
    created_user, message = User.create_user!(input_params)
---
INSERT INTO "users" ("user_name", "email", "password", "country", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update_country
    @current_user.country = params[:country]
    @current_user.save!
---
UPDATE "users" SET "country" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["country", "The Moon"], ["updated_at", "2018-11-27 21:40:26.562331"], ["id", 2]]

  def go_to_search
    @current_user.current_search=params[:search_id]
    @current_user.save!

    if !@current_user.current_search.nil?
      @curr_view_search = Search.find_by_id(@current_user.current_search)
---
UPDATE "users" SET "current_search" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["current_search", "1"], ["updated_at", "2018-12-04 21:36:05.191133"], ["id", 1]]
SELECT  "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT 1  [["id", 1]]